Ran Plan for dir: `non-prod/stage/eu-west-1` workspace: `default`

<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/31 17:21:39 Setting download directory for module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1 to /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/.terragrunt-cache
[terragrunt] 2020/01/31 17:21:39 Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1 does not have an associated terraform configuration and will be skipped.
[terragrunt] 2020/01/31 17:21:39 Setting download directory for module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3 to /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache
[terragrunt] 2020/01/31 17:21:39 Stack at /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1:
  => Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3 (excluded: false, dependencies: [])
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:39 Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3 must wait for 0 dependencies to finish
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:39 Running module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3 now
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:39 Reading Terragrunt config file at /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3/terragrunt.hcl
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:40 WARNING: no double-slash (//) found in source URL /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/_modules/s3. Relative paths in downloaded Terraform code may not work.
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:40 Downloading Terraform configurations from file:///home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/_modules/s3 into /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache/_WrX2PkotGtRHhuHh77z7gqK498/LwNtMCVnwJMSHvi2VnQpedcf1rk
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:40 Copying files from /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3 into /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache/_WrX2PkotGtRHhuHh77z7gqK498/LwNtMCVnwJMSHvi2VnQpedcf1rk
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:40 Setting working directory to /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3/.terragrunt-cache/_WrX2PkotGtRHhuHh77z7gqK498/LwNtMCVnwJMSHvi2VnQpedcf1rk
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:44 Running command: terraform plan -no-color -out /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/default.tfplan
var.role_arn
  Enter a value: 
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_caller_identity.current: Refreshing state...
aws_s3_bucket.this: Refreshing state... [id=982489228146-stage-nouveau]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.this must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
        acl                         = "private"
      ~ arn                         = "arn:aws:s3:::982489228146-stage-nouveau" -> (known after apply)
      ~ bucket                      = "982489228146-stage-nouveau" -> "982489228146-stage-test" # forces replacement
      ~ bucket_domain_name          = "982489228146-stage-nouveau.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "982489228146-stage-nouveau.s3.eu-west-1.amazonaws.com" -> (known after apply)
        force_destroy               = false
      ~ hosted_zone_id              = "Z1BKCTXD74EZPE" -> (known after apply)
      ~ id                          = "982489228146-stage-nouveau" -> (known after apply)
      ~ region                      = "eu-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
            "Environment" = "stage"
          ~ "Name"        = "nouveau" -> "test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/default.tfplan"

[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:51 Module /home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3 has finished successfully!
[terragrunt] 2020/01/31 17:21:51 Error with plan: [terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:40 Running command: terraform --version
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:40 Initializing remote state for the s3 backend
[terragrunt] [/home/atlantis/.atlantis/repos/gwendallg/atlantis-test/41/default/non-prod/stage/eu-west-1/s3] 2020/01/31 17:21:40 Running command: terraform init -backend-config=encrypt=true -backend-config=key=stage/eu-west-1/s3/terraform.tfstate -backend-config=region=eu-west-3 -backend-config=bucket=982489228146-test-infrastructure-live -backend-config=dynamodb_table=terraform-locks

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.47.0...

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d non-prod/stage/eu-west-1`
* :put_litter_in_its_place: To **delete** this plan click [here](https://stage-atlantis.adventiel.io/lock?id=gwendallg%252Fatlantis-test%252Fnon-prod%252Fstage%252Feu-west-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d non-prod/stage/eu-west-1`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
